In [1]:
try:
    # settings colab:
    # deben modificar los tokens de estas urls:
    import google.colab
    ! mkdir -p ../Data
    ! wget -O ../Data/data_filt.csv "https://raw.githubusercontent.com/Digital-House-DATA/ds_blend_students_2020/master/M1/CLASE_04/Data/data_filt.csv?token=AA4GFHMUDHAEIX2MIDG4CFS6UYMW6"
except ModuleNotFoundError:    
    # settings local:
    %run "../../../common/0_notebooks_base_setup.py"

default checking
Running command `conda list`... ok
jupyterlab=1.2.6 already installed
pandas=1.0.3 already installed
bokeh=2.0.0 already installed
seaborn=0.10.0 already installed
ipywidgets=7.5.1 already installed
pytest=5.3.4 already installed
chardet=3.0.4 already installed
psutil=5.7.0 already installed
scipy=1.4.1 already installed
statsmodels=0.11.0 already installed
scikit-learn=0.23.1 already installed
xlrd=1.2.0 already installed
nltk=3.4.5 already installed
unidecode=1.0.23 already installed
pydotplus=2.0.2 already installed
pandas-datareader=0.8.1 already installed
flask=1.0.3 already installed

---

<img src='../../../common/logo_DH.png' align='left' width=35%/>

## Dataset

En la práctica de la clase de hoy usaremos una versión muy resumida de datos de la Encuesta Permanentes de Hogares (relevamiento llevado adelante por el INDEC). Se trata de una encuesta continua que tiene como objetivo fundamental generar información sobre el funcionamiento del mercado de trabajo.

Solamente utilizaremos algunas variables (edad, nivel educativo, cantidad de horas trabajadas, calificación de la tarea e ingreso laboral) y algunos casos (los ocupados, es decir, aquellos que han trabajado al menos una hora en la semana anterior al relevamiento).

Importamos la biblioteca pandas y asignamos pd como alias:

In [2]:
import pandas as pd

## Ejercicio 1

Vamos a leer los datos del archivo /M1/CLASE_04/Data/data_filt.csv en un `DataFrame` de pandas con el método `read_csv`

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html


Este archivo tiene algunos datos numéricos y otros de tipo cadena de caracteres. 

Las columnas son:

"ch06","nivel_ed","htot","calif","p47t"

* ch06: int, edad

* nivel_ed: string, nivel educativo

* htot: int, cantidad de horas totales trabajadas en el período

* calif: string, calificación de la tarea

* p47t: int, ingreso

In [3]:
# local:
data_location = "../Data/data_filt.csv"

data = pd.read_csv(data_location, sep=",", encoding="latin1")

## Ejercicio 2

Miremos ahora los primeros tres registros del `DataFrame` data, y los ultimos cinco registros.

¿Cuántas filas tiene data? ¿Y cuántas columnas?

Ayudas:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.head.html?highlight=head#pandas.DataFrame.head

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.tail.html?highlight=tail#pandas.DataFrame.tail

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.shape.html?highlight=shape#pandas.DataFrame.shape

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.info.html?highlight=info

In [4]:
data.head(3)

   ch06           nivel_ed  htot            calif    p47t
0    46        1_H/Sec inc    45  2_Op./No calif.  6000.0
1    26  2_Sec. comp y más    25  2_Op./No calif.  5000.0
2    47  2_Sec. comp y más    25  2_Op./No calif.  5000.0

In [5]:
data.tail(5)

       ch06           nivel_ed  htot            calif     p47t
23443    45  2_Sec. comp y más    50  2_Op./No calif.   4000.0
23444    58        1_H/Sec inc    30  2_Op./No calif.   5000.0
23445    36  2_Sec. comp y más    40  2_Op./No calif.  13000.0
23446    49        1_H/Sec inc    40  2_Op./No calif.   4000.0
23447    36        1_H/Sec inc    54  2_Op./No calif.   8000.0

In [6]:
data.size

117240

In [7]:
data.shape

(23448, 5)

In [74]:
data.shape[0] #filas

23448

In [75]:
data.shape[1] #col

5

## Ejercicio 3

¿Cuáles son los nombres de las columnas del `DataFrame` data?

¿Cuál es el índice del `DataFrame` data?

Ayudas:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.columns.html?highlight=columns#pandas.DataFrame.columns

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.index.html?highlight=index#pandas.DataFrame.index

In [60]:
data.columns

Index(['edad', 'nivel_educativo', 'hs_trabajados', 'calif_ocupacional',
       'ingreso_ult_mes'],
      dtype='object')

In [61]:
data.index

RangeIndex(start=0, stop=23448, step=1)

Renombremos ahora los columnas para que queden con estos valores:

['edad', 'nivel_educativo', 'hs_trabajados', 'calif_ocupacional', 'ingreso_ult_mes']

In [50]:
#labels = ['edad', 'nivel_educativo', 'hs_trabajados', 'calif_ocupacional', 'ingreso_ult_mes']

In [51]:
#data.colums = labels

In [52]:
#data.colums

['edad',
 'nivel_educativo',
 'hs_trabajados',
 'calif_ocupacional',
 'ingreso_ult_mes']

In [54]:
data.columns = ['edad', 'nivel_educativo', 'hs_trabajados', 'calif_ocupacional', 'ingreso_ult_mes']

In [55]:
data.colums

['edad',
 'nivel_educativo',
 'hs_trabajados',
 'calif_ocupacional',
 'ingreso_ult_mes']

## Ejercicio 4 

¿Cuál es el tipo de datos de la cuarta columna de data?

In [33]:
data.columns[3]

'calif'

In [40]:
data.iloc[:,3].dtype

dtype('O')

In [78]:
data['calif_ocupacional'].dtype

dtype('O')

In [123]:
data.dtypes

edad                   int64
nivel_educativo       object
hs_trabajados          int64
calif_ocupacional     object
ingreso_ult_mes      float64
dtype: object

In [ ]:
# y que significa dtype ('0') --> 'O'     (Python) objects

## Ejercicio 5 

¿Cómo están distribuidos los niveles educativos? ¿Cuál es el más común?

Ayuda:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.value_counts.html?highlight=value_counts#pandas.Series.value_counts

In [56]:
type(data)

pandas.core.frame.DataFrame

In [57]:
data.nivel_ed.value_counts()

AttributeError: 'DataFrame' object has no attribute 'nivel_ed'

In [58]:
data.nivel_ed.value_counts

AttributeError: 'DataFrame' object has no attribute 'nivel_ed'

In [59]:
serie_nivel_educativo = data["nivel_educativo"]
serie_nivel_educativo.value_counts()

2_Sec. comp y más    14634
1_H/Sec inc           8814
Name: nivel_educativo, dtype: int64

In [80]:
data.nivel_educativo.value_counts()

2_Sec. comp y más    14634
1_H/Sec inc           8814
Name: nivel_educativo, dtype: int64

In [81]:
data.nivel_educativo.value_counts #esto no sirve

<bound method IndexOpsMixin.value_counts of 0              1_H/Sec inc
1        2_Sec. comp y más
2        2_Sec. comp y más
3              1_H/Sec inc
4              1_H/Sec inc
               ...
23443    2_Sec. comp y más
23444          1_H/Sec inc
23445    2_Sec. comp y más
23446          1_H/Sec inc
23447          1_H/Sec inc
Name: nivel_educativo, Length: 23448, dtype: object>

In [62]:
serie_nivel_educativo.mode()

0    2_Sec. comp y más
dtype: object

## Ejercicio 6

¿Cuál es el ingreso medio de la población?

In [63]:
data.ingreso_ult_mes.mean()

8107.905834186285

## Ejercicio 7

Construyamos un objeto `DataFrame` con las columnas nivel_educativo e ingreso_ult_mes de data

Seleccionemos las primeras 20 filas de este objeto `DataFrame`

Seleccionemos una muestra aleatoria de 500 filas de este objeto `DataFrame`

Ayuda:

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html?highlight=sample#pandas.DataFrame.sample

In [83]:
data.columns

Index(['edad', 'nivel_educativo', 'hs_trabajados', 'calif_ocupacional',
       'ingreso_ult_mes'],
      dtype='object')

In [87]:
data2 = data[['nivel_educativo', 'ingreso_ult_mes']] #como usando fancy indexing
data2

         nivel_educativo  ingreso_ult_mes
0            1_H/Sec inc           6000.0
1      2_Sec. comp y más           5000.0
2      2_Sec. comp y más           5000.0
3            1_H/Sec inc          11000.0
4            1_H/Sec inc           9500.0
...                  ...              ...
23443  2_Sec. comp y más           4000.0
23444        1_H/Sec inc           5000.0
23445  2_Sec. comp y más          13000.0
23446        1_H/Sec inc           4000.0
23447        1_H/Sec inc           8000.0

[23448 rows x 2 columns]

In [90]:
data2.head(21)

      nivel_educativo  ingreso_ult_mes
0         1_H/Sec inc           6000.0
1   2_Sec. comp y más           5000.0
2   2_Sec. comp y más           5000.0
3         1_H/Sec inc          11000.0
4         1_H/Sec inc           9500.0
5   2_Sec. comp y más           6000.0
6   2_Sec. comp y más           9000.0
7         1_H/Sec inc           4260.0
8         1_H/Sec inc           3800.0
9   2_Sec. comp y más          10517.0
10        1_H/Sec inc           8300.0
11  2_Sec. comp y más           4900.0
12  2_Sec. comp y más          11000.0
13  2_Sec. comp y más           9000.0
14        1_H/Sec inc           3500.0
15        1_H/Sec inc           8000.0
16        1_H/Sec inc           2500.0
17        1_H/Sec inc           7500.0
18        1_H/Sec inc           5000.0
19        1_H/Sec inc           5500.0
20  2_Sec. comp y más           7000.0

In [89]:
data2[:21]

      nivel_educativo  ingreso_ult_mes
0         1_H/Sec inc           6000.0
1   2_Sec. comp y más           5000.0
2   2_Sec. comp y más           5000.0
3         1_H/Sec inc          11000.0
4         1_H/Sec inc           9500.0
5   2_Sec. comp y más           6000.0
6   2_Sec. comp y más           9000.0
7         1_H/Sec inc           4260.0
8         1_H/Sec inc           3800.0
9   2_Sec. comp y más          10517.0
10        1_H/Sec inc           8300.0
11  2_Sec. comp y más           4900.0
12  2_Sec. comp y más          11000.0
13  2_Sec. comp y más           9000.0
14        1_H/Sec inc           3500.0
15        1_H/Sec inc           8000.0
16        1_H/Sec inc           2500.0
17        1_H/Sec inc           7500.0
18        1_H/Sec inc           5000.0
19        1_H/Sec inc           5500.0
20  2_Sec. comp y más           7000.0

In [91]:
data2.iloc[:21] #corchete porque es extraccion de datos

      nivel_educativo  ingreso_ult_mes
0         1_H/Sec inc           6000.0
1   2_Sec. comp y más           5000.0
2   2_Sec. comp y más           5000.0
3         1_H/Sec inc          11000.0
4         1_H/Sec inc           9500.0
5   2_Sec. comp y más           6000.0
6   2_Sec. comp y más           9000.0
7         1_H/Sec inc           4260.0
8         1_H/Sec inc           3800.0
9   2_Sec. comp y más          10517.0
10        1_H/Sec inc           8300.0
11  2_Sec. comp y más           4900.0
12  2_Sec. comp y más          11000.0
13  2_Sec. comp y más           9000.0
14        1_H/Sec inc           3500.0
15        1_H/Sec inc           8000.0
16        1_H/Sec inc           2500.0
17        1_H/Sec inc           7500.0
18        1_H/Sec inc           5000.0
19        1_H/Sec inc           5500.0
20  2_Sec. comp y más           7000.0

In [92]:
data2.sample(500)

         nivel_educativo  ingreso_ult_mes
10720  2_Sec. comp y más           5500.0
23199        1_H/Sec inc           5000.0
16236  2_Sec. comp y más          15000.0
22950  2_Sec. comp y más           2000.0
11174  2_Sec. comp y más           6200.0
...                  ...              ...
15166  2_Sec. comp y más           3000.0
3868         1_H/Sec inc           2000.0
1032         1_H/Sec inc           8000.0
10478  2_Sec. comp y más          11200.0
6754         1_H/Sec inc           2500.0

[500 rows x 2 columns]

In [94]:
data2.sample(30000)

ValueError: Cannot take a larger sample than population when 'replace=False'

## Ejercicio 8

Construyamos un objeto `DataFrame` con todas las columnas de data excluyendo nivel_educativo.

Ayuda: 

Construir una máscara booleana de los nombres de las columnas.

In [96]:
data.head(3)

   edad    nivel_educativo  hs_trabajados calif_ocupacional  ingreso_ult_mes
0    46        1_H/Sec inc             45   2_Op./No calif.           6000.0
1    26  2_Sec. comp y más             25   2_Op./No calif.           5000.0
2    47  2_Sec. comp y más             25   2_Op./No calif.           5000.0

In [97]:
data3 = data.drop('nivel_educativo', axis=1)
data3.head(3)

   edad  hs_trabajados calif_ocupacional  ingreso_ult_mes
0    46             45   2_Op./No calif.           6000.0
1    26             25   2_Op./No calif.           5000.0
2    47             25   2_Op./No calif.           5000.0

In [100]:
data5 = data.drop('nivel_educativo')
data5.head(3)

KeyError: "['nivel_educativo'] not found in axis"

In [99]:
data4 = data[['edad','hs_trabajados','calif_ocupacional','ingreso_ult_mes' ]]
data4.head(4)

   edad  hs_trabajados calif_ocupacional  ingreso_ult_mes
0    46             45   2_Op./No calif.           6000.0
1    26             25   2_Op./No calif.           5000.0
2    47             25   2_Op./No calif.           5000.0
3    52             90   2_Op./No calif.          11000.0

## Ejercicio 9

Ordenar data según la columna edad en forma decreciente.

Ayuda: 

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sort_values.html?highlight=sort_values#pandas.DataFrame.sort_values

In [101]:
data6= data.sort_values(by='edad', ascending=False)
data6.head(3)

,edad,nivel_educativo,hs_trabajados,calif_ocupacional,ingreso_ult_mes
22574,93,1_H/Sec inc,20,2_Op./No calif.,8000.0
16461,85,2_Sec. comp y más,40,1_Prof./Tecn.,20700.0
16954,85,2_Sec. comp y más,36,2_Op./No calif.,8250.0

In [102]:
data7= data.sort_values(by='edad', ascending=False, axis=0)
data7.head(3)

,edad,nivel_educativo,hs_trabajados,calif_ocupacional,ingreso_ult_mes
22574,93,1_H/Sec inc,20,2_Op./No calif.,8000.0
16461,85,2_Sec. comp y más,40,1_Prof./Tecn.,20700.0
16954,85,2_Sec. comp y más,36,2_Op./No calif.,8250.0

In [105]:
data8= data.sort_values(by='edad', ascending=False, axis=0, inplace=False) #ojo si inplace True reemplaza data el oroginal!
data8.head(3)

,edad,nivel_educativo,hs_trabajados,calif_ocupacional,ingreso_ult_mes
22574,93,1_H/Sec inc,20,2_Op./No calif.,8000.0
16954,85,2_Sec. comp y más,36,2_Op./No calif.,8250.0
16461,85,2_Sec. comp y más,40,1_Prof./Tecn.,20700.0

## Ejercicio 10

¿Cuál es el promedio de horas trabajadas de los jóvenes entre 14 y 25 años y poco calificados?

Ayuda:
    
Combina varias máscaras booleanas

In [106]:
data.head(3)

,edad,nivel_educativo,hs_trabajados,calif_ocupacional,ingreso_ult_mes
22574,93,1_H/Sec inc,20,2_Op./No calif.,8000.0
16461,85,2_Sec. comp y más,40,1_Prof./Tecn.,20700.0
16954,85,2_Sec. comp y más,36,2_Op./No calif.,8250.0

In [107]:
data.calif_ocupacional.value_counts()

2_Op./No calif.    17372
1_Prof./Tecn.       6076
Name: calif_ocupacional, dtype: int64

Mascara booleana

In [114]:
edad_mask = (data['edad']<=25) & (data['edad']>=14)
calificacion_mask = data['calif_ocupacional']=='2_Op./No calif.'
ambas_mask = edad_mask & calificacion_mask

In [116]:
data10 = data[ambas_mask]
data10.head(3)

,edad,nivel_educativo,hs_trabajados,calif_ocupacional,ingreso_ult_mes
3770,25,2_Sec. comp y más,32,2_Op./No calif.,2200.0
2456,25,2_Sec. comp y más,52,2_Op./No calif.,7000.0
18071,25,1_H/Sec inc,60,2_Op./No calif.,6500.0

In [118]:
data10.hs_trabajados.mean()

37.57085900688655

## Ejercicio 11

Generemos un nuevo dataframe con los trabajadores que ganan más del promedio de ingresos general y están por debajo de la cantidad media de horas trabajadas. ¿Cuántos trabajadores se encuentran en esta condición? ¿Cuál es su edad mediana?

Ayuda:

Calcular el promedio de ingresos y la media de horas trabajadas

Construir máscaras booleanas con estos valores

Indexar data con la combinación de las máscaras construidas

In [121]:
MeanWork = data.hs_trabajados.mean()
MeanIncome = data.ingreso_ult_mes.mean()

maskMeanWork = data.hs_trabajados < MeanWork
maskMeanIncome = data.ingreso_ult_mes > MeanIncome

sample2=data[maskMeanIncome & maskMeanWork]
print ("Cantidad de trabajadores : {}".format(len(sample2.index)))
print ("Edad Promedio : {} ".format(sample2.edad.mean()))

Cantidad de trabajadores : 2132
Edad Promedio : 45.046904315197